app/Models/DaftarjurusanModel.php

    public function dataJurusan() {
       return $this->findAll();
---
SELECT *
FROM `dt_jurusan`