app/Models/DaftarkelasModel.php

SELECT *
FROM `dt_kelas`
---
   public function dataKelasAll() {
      return $this->findAll();