app/Models/LoginadminModel.php

UPDATE `dt_admin` SET `nama_admin` = 'Adji Muhamad Zidan'
WHERE `dt_admin`.`id` IN ('1')
---
    public function ubahNamaAdmin($id, $nama) {
        $data = [
            'id' => $id,
            'nama_admin' => $nama
        ];

        $hasil = $this->update($id, $data);