app/Models/PeriodeajaranModel.php

      public function dataPeriode() {
         return $this->findAll();
---
SELECT *
FROM `dt_periode_ajaran`